prof_repo/ProfilPortant/TD2_NACA_Profil/simpleFoam_alpha15/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        calculated;
        value       uniform 0;
    }

    outlet
    {
        type        calculated;
        value       uniform 0;
    }

    wing
    {
        type        nutkWallFunction;
        value       uniform 0;
    }

    #include "include/frontBackTopBottomPatches"
}

// ************************************************************************* //
