prof_repo/ProfilPortant/TD2_NACA_Profil/simpleFoam_alpha15/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         4000;

deltaT          1;

writeControl    timeStep;
writeInterval   100;

purgeWrite      5;

writeFormat     ascii;
writePrecision  8;

runTimeModifiable yes;

functions
{
    #include "forces"

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p k omega);
        writeResidualFields no;
    }
}

// ************************************************************************* //
